AllowsAnalysisDisplay Method
 Identifies if this view allows display of Analysis results.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public bool AllowsAnalysisDisplay()
  Visual Basic
Public Function AllowsAnalysisDisplay As Boolean
  Visual C++
public:
bool AllowsAnalysisDisplay()
 Return Value
 True if the view allows display of Analysis results, false otherwise.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →